Repository: qasedak/Simple-Language-Switcher
Catalog: languages/simple-language-switcher-*.po
Languages: fa_ir

source: A lightweight language switcher plugin that displays a clean, modal-style language selection popup. Compatible with Polylang.
fa_ir: یک افزونه سبک برای تغییر زبان که یک پاپ آپ انتخاب زبان به سبک مودال را نمایش می دهد.

source: Action
fa_ir: عملیات

source: Add String
fa_ir: افزودن رشته

source: Add translatable strings that you can use in your templates. you can display these strings by shortcode or using the block "Translatable String" in the Gutenberg editor.<br>The identifier is uesed as a key and it can be numbers, letters and underscores only in <strong>english</strong>.<br><strong>Note:</strong> if you use a WordPress Block theme, it's recommended to use only the block "Translatable String" in the Gutenberg editor and disable the shortcodes support in the Display settings Tab.
fa_ir: رشته های قابل ترجمه را اضافه کنید که می توانید در قالب های خود استفاده کنید. می توانید این رشته ها را با کد کوتاه یا با استفاده از بلاک "Translatable String" در ویرایشگر گوتنبرگ نمایش دهید.<br> شناسه به عنوان یک کلید استفاده می شود و فقط به <strong>زبان انگلیسی</strong> می تواند اعداد، حروف و زیرخط باشد.<br> <strong>توجه:</strong> اگر از تم بلاک وردپرس استفاده می کنید، توصیه می شود فقط از بلاک "Translatable String" در ویرایشگر گوتنبرگ استفاده کنید و پشتیبانی از کدهای کوتاه را در سربرگ تنظیمات نمایش غیرفعال کنید.

source: After adding Translatable string you can translate them through Polylang
fa_ir: پس از افزودن متون ترجمه پذیر می توانید آنها را در Polylang ترجمه کنید

# block description
source: Display a translatable string across different languages
fa_ir: نمایش متون ترجمه پذیر در زبان های مختلف

# block title
source: Translatable String
fa_ir: متون ترجمه پذیر

source: Configure how the language switcher appears on your site.
fa_ir: نحوه نمایش سوییچ زبان در سایت خود را پیکربندی کنید.

source: Display country flags using Polylang's built-in flag system
fa_ir: نمایش پرچم کشورها با استفاده از سیستم پرچم داخلی Polylang

source: Display Settings
fa_ir: تنظیمات نمایش

source: Display the full language names
fa_ir: نمایش نام کامل زبان‌ها (با حروف خودشان)

source: Enable Shortcodes Support
fa_ir: فعال‌سازی پشتیبانی از کدهای کوتاه

source: Enable support for shortcodes (disable if you only use blocks for better performance)
fa_ir: فعال‌سازی پشتیبانی از کدهای کوتاه (اگر فقط از بلاک‌ استفاده می‌کنید، برای عملکرد بهتر غیرفعال کنید)

source: Enable translation of author display names across languages through Polylang
fa_ir: فعال کردن ترجمه نام نویسندگان در زبان‌های مختلف از طریق Polylang

source: here
fa_ir: اینجا کلیک کنید

source: Hide Current Language
fa_ir: مخفی کردن زبان فعلی

source: Hide languages that don't have translations for the current content
fa_ir: مخفی کردن زبان‌هایی که برای محتوای فعلی ترجمه ندارند

source: Hide the current language from the language list
fa_ir: مخفی کردن زبان فعلی از لیست زبان‌ها

source: Hide Untranslated Languages
fa_ir: مخفی کردن زبان‌های ترجمه نشده

source: Identifier
fa_ir: شناسه

source: Language Switcher
fa_ir: سوییچ زبان

source: Loading...
fa_ir: در حال بارگذاری...

source: Mohammad Anbarestany
fa_ir: محمد عنبرستانی

source: No translatable strings found. Please add some in the Settings > Translatable Strings page.
fa_ir: هیچ رشته ترجمه پذیر‌ای یافت نشد. لطفاً در صفحه تنظیمات > رشته‌های ترجمه پذیر، تعدادی اضافه کنید.

source: Note: You can use the shortcode [super-language-switcher] to display the language switcher in any post or page and the Language Popup's title (Available Languages) is translatable in Polylang settings.
fa_ir: نکته: به کمک شورت کد [super-language-switcher] می توانید سوییج زبان را در هرجا کی بخواهید به نمایش دربیاورید و عنوان پاپ‌آپ زبان (Available Languages) در بخش ترجمه Polylang قابل شخصی سازی و ترجمه است.

source: Remove
fa_ir: حذف

source: Select a string
fa_ir: یک رشته انتخاب کنید

source: Select Language
fa_ir: انتخاب زبان

source: Select Translatable String
fa_ir: انتخاب رشته ترجمه پذیر

source: Settings
fa_ir: تنظیمات

source: Shortcode
fa_ir: کدکوتاه

source: Show Flags
fa_ir: نمایش پرچم‌ها

source: Show Language Names
fa_ir: نمایش نام زبان‌ها

source: Simple Language Switcher
fa_ir: سوییچ ساده زبان

source: Simple Language Switcher Settings
fa_ir: تنظیمات سوییچ زبان

source: This plugin requires Polylang to be installed and activated.
fa_ir: این افزونه نیاز به نصب و فعال‌سازی پلاگین Polylang دارد.

source: Translatable Strings
fa_ir: رشته های ترجمه پذیر

source: Translate Author Display Names
fa_ir: ترجمه نام نویسندگان

source: Value
fa_ir: متن

source: Warning: The shortcode [translated_links] is deprecated and will be removed in next versions.
fa_ir: اخطار: در نسخه های بعدی کدکوتاه [translated_links] منسوخ خواهد شد.
